#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`failure`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/my_organization/gh-actions-demo/runs/run-gd8CXJDPNugfjVsy

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...
random_pet.sg: Refreshing state... [id=coherent-satyr]
aws_security_group.web-sg: Refreshing state... [id=sg-0989a230f20c542d1]
aws_instance.web: Refreshing state... [id=i-016776b1faba68fab]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.web will be created
  + resource "aws_instance" "web" {
      + ami                          = "ami-830c94e3"
      + arn                          = (known after apply)
      + associate_public_ip_address  = (known after apply)
      + availability_zone            = (known after apply)
      + cpu_core_count               = (known after apply)
      + cpu_threads_per_core         = (known after apply)
      + get_password_data            = false
      + host_id                      = (known after apply)
      + id                           = (known after apply)
      + instance_state               = (known after apply)
      + instance_type                = "t2.micro"
      + ipv6_address_count           = (known after apply)
      + ipv6_addresses               = (known after apply)
      + key_name                     = (known after apply)
      + outpost_arn                  = (known after apply)
      + password_data                = (known after apply)
      + placement_group              = (known after apply)
      + primary_network_interface_id = (known after apply)
      + private_dns                  = (known after apply)
      + private_ip                   = (known after apply)
      + public_dns                   = (known after apply)
      + public_ip                    = (known after apply)
      + secondary_private_ips        = (known after apply)
      + security_groups              = (known after apply)
      + source_dest_check            = true
      + subnet_id                    = (known after apply)
      + tenancy                      = (known after apply)
      + user_data                    = "c765373c563b260626d113c4a56a46e8a8c5ca33"
      + vpc_security_group_ids       = (known after apply)

      + ebs_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + snapshot_id           = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }

      + enclave_options {
          + enabled = (known after apply)
        }

      + ephemeral_block_device {
          + device_name  = (known after apply)
          + no_device    = (known after apply)
          + virtual_name = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = (known after apply)
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = (known after apply)
        }

      + network_interface {
          + delete_on_termination = (known after apply)
          + device_index          = (known after apply)
          + network_interface_id  = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = (known after apply)
          + device_name           = (known after apply)
          + encrypted             = (known after apply)
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags                  = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = (known after apply)
          + volume_type           = (known after apply)
        }
    }

  # aws_security_group.web-sg will be created
  + resource "aws_security_group" "web-sg" {
      + arn                    = (known after apply)
      + description            = "Managed by Terraform"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 8080
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8080
            },
        ]
      + name                   = "coherent-satyr-sg"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + vpc_id                 = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  ~ web-address = "ec2-54-201-254-111.us-west-2.compute.amazonaws.com:8080" -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 1 estimated
           $8.352/mo +$8.352

------------------------------------------------------------------------

Organization policy check:

================ Results for policy set: cost-estimation-policy ================

Sentinel Result: true

This result means that all Sentinel policies passed and the protected
behavior is allowed.

1 policies evaluated.

## Policy 1: cost-estimation-policy/less-than-100-month (soft-mandatory)

Result: true

./less-than-100-month.sentinel:10:1 - Rule "main"
  Value:
    true


=================== Results for policy set: terraform-guides ===================

Sentinel Result: false

This result means that one or more Sentinel policies failed. More than likely,
this was due to the discovery of violations by the main rule and other
sub-rules. Please see the details of the policies executed below to find the
violation(s), which is usually indicated by a rule with a false boolean value,
or non-zero collection data.

9 policies evaluated.

## Policy 1: terraform-guides/enforce-mandatory-tags (soft-mandatory)

Result: false

Description:
  This policy uses the Sentinel tfplan import to require that all EC2 instances  have all mandatory tags.

Print messages:

Resource aws_instance.web[0] is missing attribute tags or it is not a list or a map

./enforce-mandatory-tags.sentinel:118:1 - Rule "main"
  Description:
    Main rule

  Value:
    false

## Policy 2: terraform-guides/restrict-ec2-instance-type (advisory)

Result: false (allowed failure based on level)

Description:
  This policy uses the Sentinel tfplan import to require that  all EC2 instances have instance types from an allowed list

Print messages:

Resource aws_instance.web[0] has attribute instance_type with value t2.micro that is not in the allowed list: ["t2.small" "t2.medium" "t2.large"]

./restrict-ec2-instance-type.sentinel:100:1 - Rule "main"
  Description:
    Main rule

  Value:
    false

## Policy 3: terraform-guides/restrict-ingress-sg-rule-cidr-blocks (advisory)

Result: false (allowed failure based on level)

Description:
  This policy uses the Sentinel tfplan import to validate that no security group  rules have the CIDR "0.0.0.0/0".  It covers both the aws_security_group and  the aws_security_group_rule resources.

Print messages:

Ingress block # 0 of security group aws_security_group.web-sg[0] contains disallowed cidr_block 0.0.0.0/0

./restrict-ingress-sg-rule-cidr-blocks.sentinel:163:1 - Rule "main"
  Description:
    Main rule

  Value:
    false

## Policy 4: terraform-guides/require-private-acl-and-kms-for-s3-buckets (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan import to require that  all S3 buckets have ACL "private" and be encrypted by a KMS key

./require-private-acl-and-kms-for-s3-buckets.sentinel:113:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 5: terraform-guides/restrict-assumed-role-by-workspace (advisory)

Result: true

Description:
  This policy restricts accounts that can be assumed by the AWS provider  It includes a map that maps roles to lists of regex expressions  that match one or more workspace names  It assumes that the role_arn is either a hard-coded value or a reference  to a Terraform variable

./restrict-assumed-role-by-workspace.sentinel:177:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 6: terraform-guides/restrict-assumed-role (advisory)

Result: true

Description:
  This policy restricts accounts that can be assumed by the AWS provider  It assumes that the role_arn is either a hard-coded value or a reference  to a Terraform variable

./restrict-assumed-role.sentinel:143:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 7: terraform-guides/restrict-availability-zones (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan import to restrict  the availability zones used by EC2 instances.  This can be used to restrict the region by only listing zones in one of them.

Print messages:

Resource aws_instance.web[0] has attribute availability_zone that is computed.

./restrict-availability-zones.sentinel:102:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 8: terraform-guides/restrict-db-instance-engines (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan import to require that  all RDS database instances have engines from an allowed list

./restrict-db-instance-engines.sentinel:99:1 - Rule "main"
  Description:
    Main rule

  Value:
    true

## Policy 9: terraform-guides/restrict-launch-configuration-instance-type (advisory)

Result: true

Description:
  This policy uses the Sentinel tfplan import to require that  all EC2 instances have instance types from an allowed list.  While it could have used the common validate_attribute_in_list function,  we did not use it to provide an alternative.

./restrict-launch-configuration-instance-type.sentinel:107:1 - Rule "main"
  Description:
    Main rule

  Value:
    true


```

</details>

*Pusher: @KseniiaRyuma, Action: `pull_request`*